OpenDTEF-v1812/tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.orig/ice/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/ice";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    symmetry
    {
        type            symmetryPlane;
    }
    walls
    {
        type            noSlip;
    }
    ice_to_cabin
    {
        type            noSlip;
    }
    ice_to_exterior
    {
        type            slip;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
